<?php

return [
    'label' => 'Налаштувати',
    'modal' => [
        'heading' => 'Налаштування кодів підтвердження WhatsApp',
        'description' => 'Щоразу, коли ви входите або виконуєте чутливі дії, вам потрібно буде вводити 6‑значний код, який ми надсилаємо у WhatsApp. Перевірте свій WhatsApp, щоб отримати 6‑значний код і завершити налаштування.',
        'form' => [
            'code' => [
                'label' => 'Введіть 6‑значний код, який ми надіслали у WhatsApp',
                'validation_attribute' => 'код',
                'actions' => [
                    'resend' => [
                        'label' => 'Надіслати новий код у WhatsApp',
                        'notifications' => [
                            'resent' => [
                                'title' => 'Ми надіслали вам новий код у WhatsApp',
                            ],
                            'throttled' => [
                                'title' => 'Занадто багато спроб повторної відправки. Будь ласка, зачекайте перед наступним запитом коду.',
                            ],
                        ],
                    ],
                ],
                'messages' => [
                    'invalid' => 'Введений код недійсний.',
                ],
            ],
        ],
        'actions' => [
            'submit' => [
                'label' => 'Увімкнути коди підтвердження WhatsApp',
            ],
        ],
    ],
    'notifications' => [
        'enabled' => [
            'title' => 'Коди підтвердження WhatsApp увімкнено',
        ],
    ],
];
