<?php

return [
    'management_schema' => [
        'actions' => [
            'label' => 'کدهای تأیید واتس‌اپ',
            'below_content' => 'برای تأیید هویت هنگام ورود، یک کد موقت در واتس‌اپ خود دریافت کنید.',
            'messages' => [
                'enabled' => 'فعال',
                'disabled' => 'غیرفعال',
            ],
        ],
    ],
    'login_form' => [
        'label' => 'ارسال کد به واتس‌اپ',
        'code' => [
            'label' => 'کد ۶ رقمی ارسال‌شده از طریق واتس‌اپ را وارد کنید',
            'validation_attribute' => 'کد',
            'actions' => [
                'resend' => [
                    'label' => 'ارسال کد جدید از طریق واتس‌اپ',
                    'notifications' => [
                        'resent' => [
                            'title' => 'یک کد جدید از طریق واتس‌اپ برای شما ارسال شد',
                        ],
                        'throttled' => [
                            'title' => 'تعداد تلاش‌های ارسال مجدد بیش از حد است. لطفاً پیش از درخواست کد دیگر کمی صبر کنید.',
                        ],
                    ],
                ],
            ],
            'messages' => [
                'invalid' => 'کد وارد شده نامعتبر است.',
            ],
        ],
    ],
];
