<?php

return [
    'label' => 'خاموش کردن',
    'modal' => [
        'heading' => 'غیرفعال کردن کدهای تأیید واتس‌اپ',
        'description' => 'آیا مطمئن هستید که می‌خواهید دریافت کدهای تأیید واتس‌اپ را متوقف کنید؟ غیرفعال کردن این گزینه یک لایه امنیتی اضافی را از حساب شما حذف می‌کند.',
        'form' => [
            'code' => [
                'label' => 'کد ۶ رقمی ارسال‌شده از طریق واتس‌اپ را وارد کنید',
                'validation_attribute' => 'کد',
                'actions' => [
                    'resend' => [
                        'label' => 'ارسال کد جدید از طریق واتس‌اپ',
                        'notifications' => [
                            'resent' => [
                                'title' => 'یک کد جدید از طریق واتس‌اپ برای شما ارسال شد',
                            ],
                            'throttled' => [
                                'title' => 'تعداد تلاش‌های ارسال مجدد بیش از حد است. لطفاً پیش از درخواست کد دیگر کمی صبر کنید.',
                            ],
                        ],
                    ],
                ],
                'messages' => [
                    'invalid' => 'کد وارد شده نامعتبر است.',
                ],
            ],
        ],
        'actions' => [
            'submit' => [
                'label' => 'غیرفعال کردن کدهای تأیید واتس‌اپ',
            ],
        ],
    ],
    'notifications' => [
        'disabled' => [
            'title' => 'کدهای تأیید واتس‌اپ غیرفعال شد',
        ],
    ],
];
